Revit 2027 API
ParameterTypeId.PartMakerDivisionProfileOffset Property
 "Profile Offset"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PartMakerDivisionProfileOffset { get; }
Public Shared ReadOnly Property PartMakerDivisionProfileOffset As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PartMakerDivisionProfileOffset {
	ForgeTypeId^ get ();
}
static member PartMakerDivisionProfileOffset : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace